Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/overview_redundancy.html.txt.tmx
Source language: en
Languages: ga

source: Redundancy generally occurs where you lose your job due to circumstances such as the closure of the business or a reduction in the number of staff
ga: Go ginearálta bíonn iomarcaíocht i gceist nuair a chailltear post de bharr gnó a bheith ag dúnadh nó laghdú a bheith ag teacht ar líon na foirne oibre

source: The reason could be the financial position of the firm, lack of work, reorganisation within the firm or it may be closing down completely
ga: D'fhéadfadh staid airgeadais na comhlachta, easpa saothair, atheagrú laistigh den chomhlacht nó dúnadh na comhlachta a bheith mar chúis leis

source: Redundancy can occur where one of the following things happen:
ga: Tá iomarcaíocht i gceist nuair a tharlaíonn aon cheann díobh siúd:

source: • Your employer ceases to carry on business or ceases to carry on business in the place where you have been employed
ga: • Stopann an fostóir i mbun gnó nó i mbun gnó san áit ina raibh tusa fostaithe

source: (For example, if the firm moves location, this can be a substantial change in your working conditions and may therefore be a reason for redundancy
ga: (Mar shampla, má aistríonn an gnó a ionad oibre, d'fhéadfadh sé do choinníollacha oibre a athrú agus d'fhéadfadh cúis mhaith iomarcaíocht a bheith ann

source: However if there is a change of ownership under the transfer of undertaking legislation where employees are re-employed with no change to their working conditions then it is not a redundancy situation.)
ga: Má tá aistriú gnóthais i gceist faoin reachtaíocht, áfach, nuair a atfhostaítear fostaithe gan athrú ar bith ar a gcoinníollacha oibre, níl iomarcaíocht i gceist.)

source: • Your employer's requirements for employees in your category has ceased or diminished
ga: • Níl fostaithe ag teastáil a thuilleadh ón bhfostóir sa réimse ina bhfuil tusa fostaithe nó teastaíonn líon níos lú fostaithe sa réimse sin

source: • Your employer has decided to carry on the business with fewer or no staff
ga: • Tá cinneadh déanta ag d'fhostóir gnó a choinneáil air/uirthi le líon níos lú foirne nó gan fhoireann ar bith

source: In deciding whether your employer is continuing the business with fewer or no staff, close members of your employer's family are not taken into account
ga: Agus an fostóir ag déanamh cinnidh maidir leis an ngnó a choinneáil air/uirthi le líon níos lú foirne nó gan fhoireann, ní chuirtear baill de theaghlaigh an fhostóra san áireamh

source: • Your employer has decided to let your work be done in a different manner in future and you are not sufficiently qualified or trained to do the work in the different way
ga: • Tá cinneadh déanta ag an bhfostóir do chuid oibre a chur i gcrích i mbealach difriúil agus níl an cháilíocht chuí nó traenáil ortsa chun an obair a chur i gcrích sa bhealach sin

source: • Your employer has decided that your work will in future be done by another person who can do other work as well and you are not sufficiently qualified or trained to do that other work
ga: • Tá cinneadh déanta ag an bhfostóir go mbeidh duine eile ag déanamh do chuid oibre amach anseo chomh maith le hobair eile agus níl cáilíocht chuí nó traenáil ortsa chun an obair eile sin a dhéanamh

source: When a number of employees are being made redundant within a 30-day period this is known as a collective redundancy
ga: Tá comhiomarcaíocht i gceist nuair, taobh istigh d'aon tréimhse 30 lá, a scaoiltear líon fostaithe

source: Sometimes there is a voluntary redundancy situation
ga: Uaireanta, bíonn" iomarcaíochta dheonach" i gceist

source: This is when an employer needs to reduce the workforce and asks for some employees to volunteer for redundancy
ga: Tá iomarcaíocht dheonach i gceist nuair a bhíonn ar an bhfostóir an líon foirne a laghdú agus iarrann sé ar roinnt fostaithe iomarcaíocht dheonach a ghlacadh

source: In some cases when you have been in a lay off or short-time working situation for a certain length of time you may be entitled to claim redundancy
ga: I gcásanna áirithe nuair a bhí tréimhse leagtha as nó gearrthéarmach oibre i gceist ar feadh tréimhse áirithe ama, d'fhéadfá a bheith i dteideal iomarcaíocht a lorg

source: The Redundancy Payments Acts 1967–2014 provide a minimum entitlement to a redundancy payment for employees with a set period of service with the employer
ga: Déanann na hAchtanna Íocaíochtaí Iomarcaíochta 1967–2014 foráil do bhunmhéid a bhfuil fostóirí ina theideal mar íocaíocht iomarcaíochta agus braitheann sé ar an méid ama atá caite ag an bhfostaí sa ghnó leis an bhfostóir

source: Not all employees are entitled to this statutory redundancy payment, even where a redundancy situation exists
ga: Níl fostaithe go léir i dteideal an íocaíocht iomarcaíochta reachtúil seo, fiú nuair a bhíonn iomarcaíocht i gceist

source: You can find out more details about qualifying for redundancy here
ga: Tá níos mó sonraí ar cháiliú le hiomarcaíocht anseo

source: However, you and your employer may agree a redundancy payment above this statutory minimum and in such circumstances, employees who have not reached the statutory minimum period of service may also receive a payment
ga: Is féidir leat agus le d'fhostóir teacht ar réiteach iomarcaíochta atá níos mó ná an íosmhéid reachtúil agus sa chás sin d´fhéadfadh sé go mbeadh íocaíocht iomarcaíochta ar fáil d'fhostóirí nach bhfuil an tréimhse fostaíochta atá leagtha síos sa reachtaíocht curtha isteach acu leis an bhfostóir

source: If you are being made redundant the legislation specifies what notice must be given to you and what application forms must be completed - find out more about redundancy procedures
ga: Sonraíonn an reachtaíocht an fógra iomarcaíochta cuí a bhfuil tú i dteideal a fháil agus sonraíonn sé na foirmeacha iarratais atá le comhlíonadh - faigh amach tuilleadh faoi nósanna imeachta iomarcaíochta anseo

source: If you are entitled to a redundancy payment there are specific rules about how your continuity of service is assessed and how the payment is calculated - you can find out more about redundancy payments here
ga: Má tá tú i dteideal íocaíocht iomarcaíochta tá rialacha ar leith ag baint leis an mbealach a mheastar d'fhaid leanúnach seirbhíse agus leis an mbealach a ríomhtar d'íocaíocht - faigh tuilleadh eolais faoi íocaíochtaí iomarcaíochta anseo

source: There is also a list of frequently asked questions about redundancy
ga: Tá liosta ceisteanna a chuirtear go minic faoi iomarcaíocht

source: For further information about the Redundancy Payments Scheme contact the Workplace Relations Commission's Information and Customer Service
ga: Tá tuilleadh faisnéise faoi leas sóisialach le haghaidh iomarcaíochta foilsithe ag an Eagraíocht na hÉireann do Dhaoine Dífhostaithe (EEDD) ar an láithreán gréasáin Redundancy.ie
